//N개의 도시와 그 도시를 연결하는 N - 1개의 도로로 이루어진 도로 네트워크가 있다.
//모든 도시의 쌍에는 그 도시를 연결하는 유일한 경로가 있고, 각 도로의 길이는 입력으로 주어진다.
//총 K개의 도시 쌍이 주어진다.
//이때, 두 도시를 연결하는 경로 상에서 가장 짧은 도로의 길이와 가장 긴 도로의 길이를 구하는 프로그램을 작성하시오.

//첫째 줄에 N이 주어진다. (2 ≤ N ≤ 100, 000)
//다음 N - 1개 줄에는 도로를 나타내는 세 정수 A, B, C가 주어진다.
//A와 B사이에 길이가 C인 도로가 있다는 뜻이다.도로의 길이는 1, 000, 000보다 작거나 같은 양의 정수이다.
//다음 줄에는 K가 주어진다. (1 ≤ K ≤ 100, 000)
//다음 K개 줄에는 서로 다른 두 자연수 D와 E가 주어진다.
//D와 E를 연결하는 경로에서 가장 짧은 도로의 길이와 가장 긴 도로의 길이를 구해서 출력하면 된다.

#include <iostream>

int N;

int main()
{
    scanf("%d", &N);

    return 0;
}
